dariosalvi78/pIoT-HW/boards.txt
##############################################################

atmega328bb.name=piot

atmega328bb.upload.protocol=stk500
atmega328bb.upload.maximum_size=30720
atmega328bb.upload.speed=57600

atmega328bb.bootloader.low_fuses=0xE2
#0xE2 indicates the use of the internal clock (8MHz)

atmega328bb.bootloader.high_fuses=0xDA

atmega328bb.bootloader.extended_fuses=0x05
#use 0x07 for removing brownout detection

atmega328bb.bootloader.path=arduino:atmega
atmega328bb.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
atmega328bb.bootloader.unlock_bits=0x3F
atmega328bb.bootloader.lock_bits=0x0F

atmega328bb.build.mcu=atmega328p
atmega328bb.build.f_cpu=8000000L
atmega328bb.build.core=arduino:arduino
atmega328bb.build.variant=arduino:standard

